{"update":[[7,"{B}New feature!{/B} You now have the option to display an in-page popup icon whenever an element is blocked (off by default)","Dropped support for Chrome versions lower than version 80","Reduced the weight of the code by removing debug commands"],[6,"Another big batch of under the hood improvements to extension performance and stability!","{B}New feature!{/B} {EXTITLE} will now run on all tabs immediately when the extension is installed/enabled, and stop running when uninstalled/disabled. As before, you can still activate/deactivate the blocking via the extension's Options page."],[5,"Renamed the extension from \"Cookie Notification Blocker\" to \"{EXTITLE}\"","Overhauled options screens","Further improvements to stability",[[5,"Improved the reliability of the \"Block other kinds of annoying notifications\" feature","The blocking algorithms will now work much faster for some websites"],[4,"Stability improvements"],[3,"If enabled, elements blocked through the \"deep scanning\" feature will now be included in the calculated total on the toolbar button","Improved the accuracy of the blocking algorithms"],[2,"Dark mode colour scheme added to options screens (uses system setting)"],[1,"Various under the hood improvements"]]],[4,"Significant under the hood improvements. Several repeated computations will now be executed once and only once, saving precious CPU time on every page load!",[[6,"Various under the hood improvements"],[5,"Fixed a bug whereby the page layout would not readjust properly if {EXTITLE} is enabled and then disabled"],[4,"Fixed a rare bug whereby notices marked as blocked would still be visible","Various micro-optimisations"],[3,"Stability improvements"],[2,"Fixed a rare bug whereby cookie notices would still be blocked on pages that have been manually whitelisted"],[1,"Improved the toolbar button; it will now accurately display the number of HTML elements that {EXTITLE} has hidden","Filters updated"]]],[3,"The supplementary CSS commands no longer require the JavaScript commands to be active","Significant improvements to the accuracy of notification detection",[[16,"Various micro-optimisations"],[15,"Fixed a bug that would sometimes cause the whitelist to be unintentionally emptied","The options screen will now open much faster"],["13 - v1.3.14","Filters updated"],[12,"Fixed a JavaScript issue that could sometimes break the formatting of select websites","Various micro-optimisations"],["8 - v1.3.11","Filters updated"],[7,"Various micro-optimisations"],[6,"Filters updated"],[5,"Improved the functionality of the supplementary CSS commands","Various micro-optimisations"],[4,"Fixed a JavaScript issue that could sometimes break the formatting of select websites"],[3,"Filters updated"],[2,"Fixed a JavaScript inefficiency introduced in the previous update"],[1,"Various micro-optimisations"]]],[2,"{B}New feature!{/B} Block other kinds of annoying notifications (optional; disabled by default)","Fixed a issue that sometimes caused notices to briefly reappear on a page","Various micro-optimisations",[[13,"Various micro-optimisations"],[12,"Fixed an issue that would sometimes cause unrelated content on pages to be removed","Relaxed the required conditions to block notices when \"strict filters\" is disabled","Filters updated"],[11,"Various micro-optimisations"],[10,"Minor bugs introduced in v1.2.9 have been fixed","Significant tweaks to JS injection"],[9,"Filters updated","Various micro-optimisations"],[8,"Blocking other kinds of notifications no longer requires enabling the JavaScript commands","Numerous tweaks to CSS injection & other under the hood adjustments"],[7,"Notices will no longer be blocked on website \"sign up\" pages, as sometimes required prompts would be removed","Various micro-optimisations"],["5 - v1.2.6","Filters updated"],[4,"Various micro-optimisations"],[3,"Various micro-optimisations","Filters updated"],[2,"General improvements to stability"],[1,"Various micro-optimisations"]]],[1,"Significant under the hood improvements. {EXTITLE} is now faster, more accurate and more reliable than ever!"],[0,"Initial release",[[7,"Various micro-optimisations"],[6,"Filters updated"],[5,"Minor tweaks to CSS injection"],[4,"Filters updated","Various micro-optimisations"],[3,"Fixed an issue that caused some notices to stay on the page for long periods before being removed"],["1 - v1.0.2","Minor bugfixes"]]]]}